fix: minor documtention changes
